// Функция ДеньРожденияТекущегоПользователя - возвращает день рождения текущего пользователя
//
// Возвращаемое значение:
//  - Дата
//
Функция ДеньРожденияТекущегоПользователя()Экспорт

	Возврат СотрудникиСервер.ДеньРожденияТекущегоПользователя();

КонецФункции // ДеньРожденияТекущегоПользователя()

// Функция ПолноеИмяПользователя - возвращает полное имя пользователя
//
// Возвращаемое значение:
//   Строка   
//
Функция СотрудникПоИмениПользователя()Экспорт
	
	Возврат СотрудникиСервер.СотрудникТекущегоПользователя(); 

КонецФункции // ПолноеИмяСотрудника()


 
 