
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр Зарплата
	Движения.Зарплата.Записывать = Истина;
	Движения.Зарплата.Записать();
	
	Запрос = Новый Запрос("ВЫБРАТЬ
		|	НачислениеПремииПроцентом.Сотрудник КАК Сотрудник,
		|	НачислениеПремииПроцентом.Сотрудник.Оклад КАК Оклад
		|ИЗ
		|	Документ.НачислениеПремииПроцентом.Сотрудники КАК НачислениеПремииПроцентом
		|ГДЕ
		|	НачислениеПремииПроцентом.Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Движение = Движения.Зарплата.Добавить();
		Движение.Сторно = Ложь;
		Движение.ПериодДействияНачало = НачалоМесяца(Дата);
		Движение.ПериодДействияКонец = КонецМесяца(Дата);
		Движение.БазовыйПериодНачало = НачалоМесяца(Дата);
		Движение.БазовыйПериодКонец = КонецМесяца(Дата);
		Движение.ПериодРегистрации = Дата;
		Движение.Сотрудник = Выборка.Сотрудник;
		Движение.ВидРасчета = ПланыВидовРасчета.НачисленияУдержания.ПремияПроцентом;
	КонецЦикла;
		
	Движения.Зарплата.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
		|	ЗарплатаБазаЗарплата.НомерСтроки КАК НомерСтроки,
		|	ЗарплатаБазаЗарплата.СуммаБаза КАК СуммаБаза
		|ИЗ
		|	РегистрРасчета.Зарплата.БазаЗарплата(
		|			&Измерения,
		|			&Измерения,
		|			,
		|			Регистратор = &Регистратор
		|				И ВидРасчета = &ВидРасчета) КАК ЗарплатаБазаЗарплата";
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	Запрос.УстановитьПараметр("ВидРасчета", ПланыВидовРасчета.НачисленияУдержания.ПремияПроцентом);
	
	Измерения = Новый Массив;
	Измерения.Добавить("Сотрудник");
	
	Запрос.УстановитьПараметр("Измерения", Измерения);
	
	База = Запрос.Выполнить().Выбрать();
	
	Пока База.Следующий() Цикл
	
		ДвижениеСтрока = Движения.Зарплата[База.НомерСтроки - 1];
		СтрокаСотрудники = Сотрудники[База.НомерСтроки - 1];
		
		ДвижениеСтрока.Показатель = База.СуммаБаза;
		ДвижениеСтрока.Сумма = База.СуммаБаза * СтрокаСотрудники.ПроцентПремии / 100;
	
	КонецЦикла;
	
	Движения.Зарплата.Записать(, Истина);
	
КонецПроцедуры
