 Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо;
	Ответственный = ПараметрыСеанса.СотрудникТекущегоПользователя;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Ответственный = ПараметрыСеанса.СотрудникТекущегоПользователя;
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	//ЭтоЮридическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо;
	//	
	//Если ЮридическоеФизическоеЛицо = ЭтоЮридическоеЛицо Тогда
	//	ПроверкаИННИКППЮрЛица(Отказ);
	//Иначе
	//	ПроверкаИННИКППФизЛица(Отказ);
	//КонецЕсли;

КонецПроцедуры

Процедура ПроверкаИННИКППФизЛица(Отказ)
	
	ДлинаИНН = СтрДлина(ИНН);
	
	Если ЗначениеЗаполнено(КПП) Тогда 
		Сообщить("У физического лица КПП должно быть пустым!");
		Отказ = Истина;
	КонецЕсли;
		
	Если Не ЗначениеЗаполнено(ИНН) ИЛИ ДлинаИНН <> 12 Тогда
		Сообщить("У физического лица ИНН должно быть заполнено и иметь 12 символов!");
		Отказ = Истина;
	КонецЕсли;    
	
	МассивЗапрещенныхСимволов = Новый Массив;
	
	Для Счетчик = 1 По ДлинаИНН Цикл
	
		СимволСтроки = Сред(ИНН, Счетчик, 1);
		КодСимволаСтроки = КодСимвола(СимволСтроки);
		
		Если КодСимволаСтроки < 48 ИЛИ КодСимволаСтроки > 57 Тогда 
			МассивЗапрещенныхСимволов.Добавить(СимволСтроки);
		КонецЕсли;
	
	КонецЦикла;
	
	Если МассивЗапрещенныхСимволов.Количество() > 0 Тогда 
		Сообщить("У физического лица ИНН не должно иметь запрещенные символы!");
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры 

Процедура ПроверкаИННИКППЮрЛица(Отказ)
	
	ДлинаИНН = СтрДлина(ИНН);
	ДлинаКПП = СтрДлина(КПП);
	
	Если Не ЗначениеЗаполнено(КПП) ИЛИ СтрДлина(КПП) <> 9 Тогда 
		Сообщить("У юридического лица КПП должен быть заполнен, и иметь длину 9 символов!");
		Отказ = Истина;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ИНН) ИЛИ СтрДлина(ИНН)<> 10 Тогда 
		Сообщить("У юридического лица ИНН должно иметь 10 символов!");
		Отказ = Истина;
	КонецЕсли;
	
	МассивЗапрещенныхСимволов = Новый Массив;
	
	Для Счетчик = 1 По ДлинаИНН Цикл
		СимволСтроки = Сред(ИНН, Счетчик, 1);
		КодСимволаСтроки = КодСимвола(СимволСтроки);
		
		Если КодСимволаСтроки < 48 ИЛИ КодСимволаСтроки > 57 Тогда 
			МассивЗапрещенныхСимволов.Добавить(СимволСтроки);
		КонецЕсли;
	КонецЦикла;
	
	Если МассивЗапрещенныхСимволов.Количество() > 0 Тогда 
		Сообщить("У юридического лица ИНН не должно иметь запрещенные символы!");
		Отказ = Истина; 
		МассивЗапрещенныхСимволов.Очистить();
	КонецЕсли;
	
	Для Счетчик = 1 По ДлинаКПП Цикл
		СимволСтроки = Сред(КПП, Счетчик, 1);
		КодСимволаСтроки = КодСимвола(СимволСтроки);
		
		Если КодСимволаСтроки < 48 ИЛИ КодСимволаСтроки > 57 Тогда 
			МассивЗапрещенныхСимволов.Добавить(СимволСтроки);
		КонецЕсли;
	КонецЦикла;
	
	Если МассивЗапрещенныхСимволов.Количество() > 0 Тогда 
		Сообщить("У юридического лица КПП не должно иметь запрещенные символы!");
		Отказ = Истина; 
	КонецЕсли; 
	
	Если Не РаботаСИННКлиентСервер.ИННВерен(ИНН) Тогда
		Сообщить("Контрольные соотношения не верны!");
		Отказ = Истина; 
	КонецЕсли; 

	
КонецПроцедуры 

