Функция ЦенаНаДату(Номенклатура, Дата) Экспорт
	
	Результат = ЦеныСервер.ЦенаНаДату(Номенклатура, Дата);
	
	Возврат Результат;
	
КонецФункции

Функция СкидкаНаДату(Знач Номенклатура, Дата) Экспорт
	
	Результат = ЦеныСервер.СкидкаНаДату(Номенклатура, Дата);
	
	Возврат Результат;
	
КонецФункции

Функция РасчётЦены(Знач Сумма, Знач Количество) Экспорт
	
	Результат = ЦеныСервер.РасчётЦены(Сумма, Количество);

	Возврат Результат;
	
КонецФункции

Функция РасчётСуммы(Знач Сумма, Знач Скидка) Экспорт
	
	Результат = ЦеныСервер.РасчётСуммы(Сумма, Скидка);

	Возврат Результат;
	
КонецФункции