
&НаСервере
Процедура ПересчитатьНаСервере()
	
	//СтруктураОтбора = СтруктураОтбораПоДокументу();
	
	Выборка = Документы.ПоступлениеТоваровУслуг.Выбрать(ДатаНачала,ДатаОкончания);
	Пока Выборка.Следующий() Цикл 
		
		ДокументОбъект = Выборка.ПолучитьОбъект();
		
		Для каждого СтрокаТовары Из ДокументОбъект.Товары Цикл
			СтрокаТовары.Сумма = СтрокаТовары.Цена * СтрокаТовары.Количество;
		КонецЦикла;
		
		ДокументОбъект.СуммаДокумента = ДокументОбъект.Товары.Итог("Сумма");
		
		Попытка
			ДокументОбъект.Записать();
		Исключение
			
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ТекстСообщения = ОбработкаОшибок.СообщениеОбОшибкеДляПользователя(ИнформацияОбОшибке);
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Не удалось обновить суммы у документа № '"),ДокументОбъект.Номер); 
			
			ВызватьИсключение(ТекстСообщения,,,, ИнформацияОбОшибке);
			
		КонецПопытки;

		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Пересчитать(Команда)
	ПересчитатьНаСервере();
КонецПроцедуры

&НаСервере
Функция СтруктураОтбораПоДокументу()

	СтруктураОтбора = Новый Структура;
	//СтруктураОтбора.Вставить("ПометкаУдаления", Ложь);
	СтруктураОтбора.Вставить("Проведен", Истина);
	
	Возврат СтруктураОтбора;
	
КонецФункции
