Функция ЦенаНаДату(Номенклатура, Дата) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
		|	СУММА(ЦеныПоставщиковСрезПоследних.Цена) КАК Цена
		|ИЗ
		|	РегистрСведений.ЦеныПоставщиков.СрезПоследних(&Дата, &Номенклатура = Номенклатура) КАК ЦеныПоставщиковСрезПоследних";
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Дата", Дата);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Цена = 0;
	
	Пока Выборка.Следующий() Цикл
		Цена = Выборка.Цена;
	КонецЦикла;
	
	Возврат Цена;
	
КонецФункции

Функция СкидкаНаДату(Знач Номенклатура, Дата) Экспорт
	
	Скидка = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
		|	СкидкиСрезПоследних.Скидка КАК Скидка
		|ИЗ
		|	РегистрСведений.Скидки.СрезПоследних(&Дата, НоменклатураНоменклатурнаяГруппа = &Номенклатура) КАК СкидкиСрезПоследних";
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Дата", Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	ПустойЗапрос = РезультатЗапроса.Пустой();
	
	Если ПустойЗапрос И ТипЗнч(Номенклатура) = Тип("СправочникСсылка.Номенклатура") Тогда
		Номенклатура = Номенклатура.НоменклатурнаяГруппа;
		Скидка = СкидкаНаДату(Номенклатура, Дата);
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Скидка = Выборка.Скидка;
	КонецЦикла;
	
	Возврат Скидка;
	
КонецФункции

Функция РасчётЦены(Знач Сумма, Знач Количество) Экспорт
	
	Результат = 0;
	
	Если ЗначениеЗаполнено(Количество) Тогда
		Результат = Окр(Сумма / Количество, 2, РежимОкругления.Окр15как10);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция РасчётСуммы(Знач Сумма, Знач Скидка) Экспорт
	
	Результат = Сумма;
	
	Если ЗначениеЗаполнено(Скидка) Тогда
		Результат = Сумма - Сумма * (Скидка / 100);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции