
&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	Объект.ПолноеНаименование = Объект.Наименование;
КонецПроцедуры

&НаКлиенте
Процедура ИННПриИзменении(Элемент)

	ИННВерен = РаботаСИННКлиентСервер.ИННВерен(Объект.ИНН);  
	
	Если ИННВерен Тогда
		Элементы.ИНН.ЦветТекста = ЗеленыйЦвет();  
	Иначе
		Сообщить("Контрольные проверки ИНН неправильные!");
		Элементы.ИНН.ЦветТекста = КрасныйЦвет(); 
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗеленыйЦвет()

	Возврат ЦветаСтиля.ЦветАкцента;

КонецФункции // ()

&НаСервере
Функция КрасныйЦвет()

	Возврат ЦветаСтиля.ЦветОтрицательногоЧисла;

КонецФункции // ()


