
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ОтветственныйСотрудник = ПараметрыСеанса.СотрудникТекущегоПользователя;
	
	Для каждого Запись Из ЭтотОбъект Цикл
		Запись.Ответственный = ОтветственныйСотрудник;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОтветственныйСотрудник = ПараметрыСеанса.СотрудникТекущегоПользователя;
	
	Для каждого Запись Из ЭтотОбъект Цикл
		
		Если Не ЗначениеЗаполнено(Запись.Ответственный) Тогда
			Запись.Ответственный = ОтветственныйСотрудник;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
