
&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("УстановитьОтборЦен", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборЦен()

	ПолеНоменклатура = Новый ПолеКомпоновкиДанных("Номенклатура");
	ВыбранноеЗначение = Элементы.Список.ТекущаяСтрока;
	РаботаСФормамиКлиент.УстановитьОтборВСписке(СписокЦен, ПолеНоменклатура, ВыбранноеЗначение);

КонецПроцедуры

&НаКлиенте
Процедура СоздатьСтандартныеУпаковки(Команда)
	СоздатьСтандартныеУпаковкиНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СоздатьСтандартныеУпаковкиНаСервере()
	
	ТабличныйДокумент = Справочники.Упаковки.ПолучитьМакет("СтандартныеУпаковки");
	
	КоличествоСтрок = ТабличныйДокумент.ВысотаТаблицы;
	
	ДанныеФайла = Новый Массив;
	ШаблонСообщения = "Упаковка %1 создана!";
	
	Для Сч = 1 По КоличествоСтрок Цикл
		
		ВидУпаковкиИмя = ТабличныйДокумент.Область(Сч,1).Текст;
		
		ВидУпаковкиНайден = Справочники.Упаковки.НайтиПоНаименованию(ВидУпаковкиИмя);
		
		Если ВидУпаковкиНайден = Неопределено ИЛИ ВидУпаковкиНайден = Справочники.Упаковки.ПустаяСсылка() Тогда
			
			СоздатьУпаковку(ВидУпаковкиИмя);
			Сообщить(СтрШаблон(ШаблонСообщения,ВидУпаковкиИмя));
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СоздатьУпаковку(ВидУпаковкиИмя)
	
	НовыйВидУпаковки = Справочники.Упаковки.СоздатьЭлемент();
	НовыйВидУпаковки.Наименование = ВидУпаковкиИмя;
	НовыйВидУпаковки.Записать();
	
КонецПроцедуры

