
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ВзаиморасчетыСКонтрагентами.Записывать = Истина;
	ДвижениеВзаиморасчеты = Движения.ВзаиморасчетыСКонтрагентами.ДобавитьПриход();
	ДвижениеВзаиморасчеты.Период = Дата;
	ДвижениеВзаиморасчеты.Контрагент = Плательщик;
	ДвижениеВзаиморасчеты.Сумма = Сумма;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Ответственный = ПараметрыСеанса.СотрудникТекущегоПользователя;
КонецПроцедуры
