
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр Зарплата
	Движения.Зарплата.Записывать = Истина;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
		|	НачислениеПоОкладуСотрудники.Сотрудник КАК Сотрудник,
		|	НачислениеПоОкладуСотрудники.Сотрудник.Оклад КАК Оклад
		|ИЗ
		|	Документ.НачислениеПоОкладу.Сотрудники КАК НачислениеПоОкладуСотрудники
		|ГДЕ
		|	НачислениеПоОкладуСотрудники.Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Движение = Движения.Зарплата.Добавить();
		Движение.Сторно = Ложь;
		Движение.ПериодДействияНачало = НачалоМесяца(Дата);
		Движение.ПериодДействияКонец = КонецМесяца(Дата);
		Движение.ПериодРегистрации = Дата;
		Движение.Сотрудник = Выборка.Сотрудник;
		Движение.Показатель = Выборка.Оклад;
		Движение.ВидРасчета = ПланыВидовРасчета.НачисленияУдержания.ОплатаПоОкладу;
	КонецЦикла;
	
	Движения.Зарплата.Записать();
	
	Для каждого Движение Из Движения.Зарплата Цикл
		
		Отбор = Новый Структура("Регистратор, Сотрудник", Ссылка, Движение.Сотрудник);
		
		Норма = РегистрыРасчета.Зарплата.ПолучитьДанныеГрафика(Отбор, ВидПериодаРегистраРасчета.ПериодДействия)[0].РабочийДень;
		Факт = РегистрыРасчета.Зарплата.ПолучитьДанныеГрафика(Отбор, ВидПериодаРегистраРасчета.ФактическийПериодДействия)[0].РабочийДень;
		
		Движение.Сумма = ?(Норма = 0, 0, Движение.Показатель * Факт / Норма);
		
	КонецЦикла;
	
	Движения.Зарплата.Записать(, Истина);
	
	
КонецПроцедуры
