
&НаСервере
Процедура ВосстановитьНаСервере()
	
	Последовательности.СкладскиеДокументы.Восстановить();
	ПрочитатьГраницуНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура Восстановить(Команда)
	ВосстановитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьГраницу(Команда)
	ПрочитатьГраницуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПрочитатьГраницуНаСервере()

	ГраницаПоследовательности = Последовательности.СкладскиеДокументы.ПолучитьГраницу();
	ГраницаДата = ГраницаПоследовательности.Дата;
	ГраницаСсылка = ГраницаПоследовательности.Ссылка;

КонецПроцедуры