
Процедура ПрайсЛист(ТабличныйДокумент, Ссылка) Экспорт
	
	Макет = Справочники.Номенклатура.ПолучитьМакет("ПрайсЛист");
	
	Выборка = РаботаСНоменклатуройСервер.ПоследниеЦеныНоменклатуры(Ссылка);
	
	ТабличныйДокумент.Очистить();
	
	СтруктураЗаполнения = Новый Структура("Дата",Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy"));
	//ВставлятьРазделительСтраниц = Ложь;
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьЗаголовок.Параметры.Заполнить(СтруктураЗаполнения);
	ТабличныйДокумент.Вывести(ОбластьЗаголовок);
	
	Шапка = Макет.ПолучитьОбласть("Шапка");
	Шапка.Параметры.Заполнить(Выборка);
	ТабличныйДокумент.Вывести(Шапка, Выборка.Уровень());
	
	Строка = Макет.ПолучитьОбласть("Строка");
	
	Пока Выборка.Следующий() Цикл
		//Если ВставлятьРазделительСтраниц Тогда
		//	ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		//КонецЕсли;
		
		Строка.Параметры.Заполнить(Выборка);
		ТабличныйДокумент.Вывести(Строка);
		
		//ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	
КонецПроцедуры
