
&НаКлиенте
Процедура ЧастиФайлаПутьКЧастиНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ОбработатьВыборЧастиФайла();
КонецПроцедуры

&НаКлиенте
Процедура ПутьКИсходномуФайлуНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ОбработатьВыборИсходногоФайла();
КонецПроцедуры

&НаКлиенте
Асинх Процедура ОбработатьВыборИсходногоФайла()
	
	ПараметрыВыбораФайла = Новый ПараметрыДиалогаПомещенияФайлов;
	ПараметрыВыбораФайла.Заголовок = "Выберите исходный файл";
	ПараметрыВыбораФайла.МножественныйВыбор = Ложь;
	
	Результат = Ждать ПоместитьФайлНаСерверАсинх(,,,ПараметрыВыбораФайла,УникальныйИдентификатор);
	
	Если Результат = Неопределено ИЛИ Результат.ПомещениеФайлаОтменено Тогда
		Возврат;
	КонецЕсли;
	
	ПутьКИсходномуФайлу = Результат.СсылкаНаФайл.Файл.ПолноеИмя;
	ВременныйАдресФайла = Результат.Адрес;
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ОбработатьВыборЧастиФайла()
	
	ПараметрыВыбораФайла = Новый ПараметрыДиалогаПомещенияФайлов;
	ПараметрыВыбораФайла.Заголовок = "Выберите исходный файл";
	ПараметрыВыбораФайла.МножественныйВыбор = Ложь;
	
	Результат = Ждать ПоместитьФайлНаСерверАсинх(,,,ПараметрыВыбораФайла,УникальныйИдентификатор);
	
	Если Результат = Неопределено ИЛИ Результат.ПомещениеФайлаОтменено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийЭлемент.ТекущиеДанные.ПутьКЧасти = Результат.СсылкаНаФайл.Файл.ПолноеИмя;
	ВременныйАдресФайла = Результат.Адрес;
	
КонецПроцедуры

&НаКлиенте
Процедура РазбитьФайлНаЧасти(Команда)
	
	ОбработатьПоток();
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ОбработатьПоток()
	
	Если Не ЗначениеЗаполнено(КаталогСЧастямиФайла) Тогда
		Сообщить("Не выбран каталог для сохранения частей файла!");
		Возврат;
	КонецЕсли;
	
	ОписаниеФайла = Новый Файл(ПутьКИсходномуФайлу);
	ОсталосьПрочитать = Ждать ОписаниеФайла.РазмерАсинх();
	
	ПотокИсходный = Новый ФайловыйПоток(ОписаниеФайла.ПолноеИмя, РежимОткрытияФайла.Открыть, ДоступКФайлу.Чтение);
	
	Если РазмерЧастиВБайтах > ОсталосьПрочитать Тогда
		Сообщить("Указанный размер деления больше объема файла. Файл не будет разделен");
		Возврат;
	КонецЕсли;
	
	Счетчик = 1;
	
	Пока ОсталосьПрочитать > 0 Цикл
	
		ПотокКонечный = Новый ФайловыйПоток(КаталогСЧастямиФайла + "\Часть" + Счетчик, РежимОткрытияФайла.СоздатьНовый, ДоступКФайлу.Запись);
		
		Если РазмерЧастиВБайтах < ОсталосьПрочитать Тогда
			ПотокИсходный.КопироватьВАсинх(ПотокКонечный,РазмерЧастиВБайтах);
		Иначе
			ПотокИсходный.КопироватьВАсинх(ПотокКонечный,ОсталосьПрочитать);
		КонецЕсли;
		
		ПотокКонечный.ЗакрытьАсинх();
		
		ОсталосьПрочитать = ОсталосьПрочитать - РазмерЧастиВБайтах;
		Счетчик = Счетчик + 1;

	КонецЦикла;
	
	ПотокКонечный.ЗакрытьАсинх();
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогСЧастямиФайлаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ОбработатьВыборКаталога();
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ОбработатьВыборКаталога()
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогВыбораФайла.Заголовок = "Выберите каталог";
	
	РезультатВыбора = Ждать ДиалогВыбораФайла.ВыбратьАсинх();
	
	Если РезультатВыбора = Неопределено Тогда
		Сообщить("Каталог не выбран!");
		Возврат;
	КонецЕсли;
	
	КаталогСЧастямиФайла = РезультатВыбора[0];
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ОбъединитьФайл()
	
	Если Не ЗначениеЗаполнено(КаталогРезультат) Тогда
		Сообщить("Каталог для выгрузки файла-результата не выбран!");
		Возврат;
	КонецЕсли;
	
	ОписаниеФайла = Новый Файл(КаталогРезультат);
	ПотокКонечный = Новый ФайловыйПоток(ОписаниеФайла.ПолноеИмя + "\Итог", РежимОткрытияФайла.СоздатьНовый, ДоступКФайлу.Запись);
	
	Для Каждого Строка Из ЧастиФайла Цикл  
		ПотокИсходный = Новый ФайловыйПоток(Строка.ПутьКЧасти, РежимОткрытияФайла.Открыть, ДоступКФайлу.Чтение); 
		ПотокИсходный.КопироватьВАсинх(ПотокКонечный);
		ПотокИсходный.ЗакрытьАсинх();
	КонецЦикла;  
	
	ПотокКонечный.ЗакрытьАсинх();
	
КонецПроцедуры

&НаКлиенте
Процедура СобратьФайл(Команда)
	ОбъединитьФайл();
КонецПроцедуры

&НаКлиенте
Процедура КаталогРезультатНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ОбработатьВыборКаталогаРезультат();
КонецПроцедуры

&НаКлиенте
Асинх Процедура ОбработатьВыборКаталогаРезультат()
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогВыбораФайла.Заголовок = "Выберите каталог";
	
	РезультатВыбора = Ждать ДиалогВыбораФайла.ВыбратьАсинх();
	
	Если РезультатВыбора = Неопределено Тогда
		Сообщить("Каталог не выбран!");
		Возврат;
	КонецЕсли;
	
	КаталогРезультат = РезультатВыбора[0];
	
КонецПроцедуры


