Процедура ЗаполнитьПредопределенныеЭлементы() Экспорт

	ТипАдрес = Перечисления.ТипыКонтактнойИнформации.Адрес; 
	
	ПредопределенныйОбъект = ЮридическийАдресКонтрагента.ПолучитьОбъект();
	ПредопределенныйОбъект.Тип = ТипАдрес;
	ПредопределенныйОбъект.Записать();
	
	ПредопределенныйОбъект = ПочтовыйАдресКонтрагента.ПолучитьОбъект();
	ПредопределенныйОбъект.Тип = ТипАдрес;
	ПредопределенныйОбъект.Записать();
	
	ПредопределенныйОбъект = ФактическийАдресКонтрагента.ПолучитьОбъект();
	ПредопределенныйОбъект.Тип = ТипАдрес;
	ПредопределенныйОбъект.Записать();
	
	ПредопределенныйОбъект = МобильныйТелефонКонтрагента.ПолучитьОбъект();
	ПредопределенныйОбъект.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
	ПредопределенныйОбъект.Записать();
	
	ПредопределенныйОбъект = РабочийТелефонКонтрагента.ПолучитьОбъект();
	ПредопределенныйОбъект.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
	ПредопределенныйОбъект.Записать();
	
	ПредопределенныйОбъект = EMailКонтрагента.ПолучитьОбъект();
	ПредопределенныйОбъект.Тип = Перечисления.ТипыКонтактнойИнформации.EMail;
	ПредопределенныйОбъект.Записать();

КонецПроцедуры
