
Процедура ПриНачалеРаботыСистемы()
	
	ОбновлениеИнформационнойБазыВызовСервера.ПриНачалеРаботыСистемы();
	
	ТекущаяДата = ТекущаяДата();
	
	ВидДняНеделиИВремя = РаботаСДатамиКлиент.ОпределитьВыходнойИлиБуднийДеньСоВременем(ТекущаяДата);
	
	ПредупреждениеАсинх(СтрШаблон("Сегодня %1. %2",Формат(ТекущаяДата,"ДФ=дддд"),ВидДняНеделиИВремя)); 
	
	МассивПраздничныхДат = РаботаСДатамиКлиент.ПолучитьМассивПраздников();
	
	Для каждого ЭлементМассивПраздничныхДат Из МассивПраздничныхДат Цикл
	
		Если ЭлементМассивПраздничныхДат.Дата = НачалоДня(ТекущаяДата) Тогда
			ПредупреждениеАсинх(СтрШаблон("Сегодня праздник %1", ЭлементМассивПраздничныхДат.Наименование)); 
		ИначеЕсли ЭлементМассивПраздничныхДат.Дата = НачалоДня(ТекущаяДата)+86400 Тогда
			ПредупреждениеАсинх(СтрШаблон("Завтра праздник %1", ЭлементМассивПраздничныхДат.Наименование));
		КонецЕсли;
	
	КонецЦикла;

	ДатаРожденияТекущегоПользователя = СотрудникиВызовСервера.ДеньРожденияТекущегоПользователя();
	
	Если (День(ДатаРожденияТекущегоПользователя) И Месяц(ДатаРожденияТекущегоПользователя)) = (День(ТекущаяДата) И Месяц(ТекущаяДата)) Тогда
		ПредупреждениеАсинх(СтрШаблон("С днём рождения, %1!",СотрудникиВызовСервера.СотрудникПоИмениПользователя()));
	КонецЕсли;
	
КонецПроцедуры


