&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СортироватьПоВозрастанию = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ПриИзмененииЦеныИКоличествоТовары();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	ПриИзмененииЦеныИКоличествоТовары();
КонецПроцедуры

&НаКлиенте
Функция НовыйСписокДействийПриИзмененииТЧТовары()
	
	СтруктураДействий = Новый Структура;
	
	СтруктураДействий.Вставить("ЗаполнитьСумму", Ложь);
	СтруктураДействий.Вставить("ЗаполнитьМаксимальноеКоличествоТоваров", Ложь);
	СтруктураДействий.Вставить("ЗаполнитьСуммуПоСтавкеНДС", Ложь);
	
	Возврат СтруктураДействий;
	
КонецФункции

&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент)
	
	СписокДействий = НовыйСписокДействийПриИзмененииТЧТовары();
	СписокДействий.Вставить("ЗаполнитьСуммуПоСтавкеНДС", Истина);
	СписокДействий.Вставить("ЗаполнитьМаксимальноеКоличествоТоваров", Истина);
	
	ОбработатьСтрокуТЧ(СписокДействий);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСтавкаНДСПриИзменении(Элемент)
	
	СписокДействий = НовыйСписокДействийПриИзмененииТЧТовары();
	СписокДействий.Вставить("ЗаполнитьСуммуПоСтавкеНДС", Истина);
	
	ОбработатьСтрокуТЧ(СписокДействий);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииЦеныИКоличествоТовары()
	
	СписокДействий = НовыйСписокДействийПриИзмененииТЧТовары();
	СписокДействий.Вставить("ЗаполнитьСумму", Истина);
	СписокДействий.Вставить("ЗаполнитьМаксимальноеКоличествоТоваров", Истина);
	
	ОбработатьСтрокуТЧ(СписокДействий);

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьСтрокуТЧ(СписокДействий)
	
	Если СписокДействий.ЗаполнитьСумму Тогда
		ЗаполнитьСуммуВТЧТовары();
	ИначеЕсли СписокДействий.ЗаполнитьМаксимальноеКоличествоТоваров Тогда
		ЗаполнитьМаксимальноеКоличествоТоваров();
	ИначеЕсли СписокДействий.ЗаполнитьСуммуПоСтавкеНДС Тогда
		ЗаполнитьСуммуПоСтавкеНДС();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСуммуВТЧТовары()
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;  
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрока.Сумма = Элементы.Товары.ТекущиеДанные.Цена * Элементы.Товары.ТекущиеДанные.Количество;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьМаксимальноеКоличествоТоваров()
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Элементы.Товары.ТекущиеДанные.Цена) И ЗначениеЗаполнено(Элементы.Товары.ТекущиеДанные.Сумма)Тогда
		ТекущаяСтрока.Количество = Окр(Элементы.Товары.ТекущиеДанные.Сумма/Элементы.Товары.ТекущиеДанные.Цена,0,РежимОкругления.Окр15как10);
		ТекущаяСтрока.Сумма = Элементы.Товары.ТекущиеДанные.Цена * Элементы.Товары.ТекущиеДанные.Количество;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СортироватьПоСумме(Команда)
	
	Если СортироватьПоВозрастанию Тогда
		Объект.Товары.Сортировать("Сумма Возр");
		СортироватьПоВозрастанию = Ложь;
		Элементы.СортироватьПоСумме.Картинка = БиблиотекаКартинок.ОформлениеСтрелкаНаклоннаяВнизСерая;
	Иначе
		Объект.Товары.Сортировать("Сумма Убыв");
		СортироватьПоВозрастанию = Истина;  
		Элементы.СортироватьПоСумме.Картинка = БиблиотекаКартинок.ОформлениеСтрелкаНаклоннаяВверхСерая;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСуммуПоСтавкеНДС()
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;  
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	ТекущаяСтрока.СуммаНДС = НДСКлиентСервер.СуммаНДСПоСтавке(Элементы.Товары.ТекущиеДанные.Сумма, Элементы.Товары.ТекущиеДанные.СтавкаНДС);
	
КонецПроцедуры

