
&НаСервере
Процедура РассчитатьНаСервере()
	
	Премии.Очистить();
	Продажи = РегистрыНакопления.Продажи.Обороты(Период.ДатаНачала,Период.ДатаОкончания);
	
	СписокСотрудников = СписокСотрудников();
	
	Для каждого Сотрудник Из СписокСотрудников Цикл
	
		Отбор = Новый Структура;
		Отбор.Вставить("Сотрудник", Сотрудник);
		
		ПродажиПоСотруднику = Продажи.НайтиСтроки(Отбор);
		
		Если ПродажиПоСотруднику.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СуммаПремии = 0;
		Для каждого СтрокаПродажиПоСотруднику Из ПродажиПоСотруднику Цикл
			
			ТипНоменклатуры = СтрокаПродажиПоСотруднику.Номенклатура.ТипНоменклатуры;
			Процент = ?(ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга,ПроцентУслуги,ПроцентТовары);
			
			Премия = СтрокаПродажиПоСотруднику.Сумма / 100 * Процент;
			
			СуммаПремии = СуммаПремии + Премия;
			
		КонецЦикла;
		
		СтрокаПремии = Премии.Добавить();
		СтрокаПремии.Сотрудник = Сотрудник;
		СтрокаПремии.Сумма = СуммаПремии;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Рассчитать(Команда)
	
	РассчитатьНаСервере();
	
	Элементы.ПремииСумма.ТекстПодвала = Премии.Итог("Сумма");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СписокСотрудников()

	ВыборкаПоСотрудникам = Справочники.Сотрудники.Выбрать();
	Результат = НовыйМассив();
	
	Пока ВыборкаПоСотрудникам.Следующий() Цикл
	
		Если ВыборкаПоСотрудникам.ПометкаУдаления Тогда
			Продолжить;
		КонецЕсли;
		
		Результат.Добавить(ВыборкаПоСотрудникам.Ссылка);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция НовыйМассив()
	Возврат Новый Массив;
КонецФункции