
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если Объект.Согласовано Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	Если РольДоступна("ПолныеПрава") Тогда
		ЭтаФорма.ТолькоПросмотр = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СкидкиНоменклатураНоменклатурнаяГруппаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Скидки.ТекущиеДанные;
	ПриИзмененииНоменклатуры(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииНоменклатуры(ИзмененнаяСтрока)

	Если ЗначениеЗаполнено(ИзмененнаяСтрока.НоменклатураНоменклатурнаяГруппа) Тогда
		Скидка = ЦеныВызовСервера.СкидкаНаДату(ИзмененнаяСтрока.НоменклатураНоменклатурнаяГруппа, ТекущаяДата());
		
		Если Не ЗначениеЗаполнено(Скидка) И ТипЗнч(ИзмененнаяСтрока.НоменклатураНоменклатурнаяГруппа) = Тип("СправочникСсылка.НоменклатурныеГруппы") Тогда
			
			НоменклатурнаяГруппа = ИзмененнаяСтрока.НоменклатураНоменклатурнаяГруппа;
			
			Если ЗначениеЗаполнено(НоменклатурнаяГруппа) Тогда
				Скидка = ЦеныВызовСервера.СкидкаНаДату(НоменклатурнаяГруппа, ТекущаяДата());
			КонецЕсли;
			
		КонецЕсли;
		
		ИзмененнаяСтрока.Скидка = Скидка;
		
	КонецЕсли;
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьНоменклатурнуюГруппу(Номенклатура)
	
	Возврат Номенклатура.НоменклатурнаяГруппа;
	
КонецФункции


