Функция НовыйОтборПоКонтрагентуИНоменклатуре(Номенклатура)Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Номенклатура", Номенклатура);
	
	Возврат Результат;
	
КонецФункции

Функция ПоследниеЦеныНоменклатуры(МассивНоменклатуры)Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_Номенклатура
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка В(&Ссылка)
		|	И НЕ Номенклатура.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЦеныПродажиНоменклатурыСрезПоследних.Цена КАК Цена,
		|	ВТ_Номенклатура.Ссылка КАК Номенклатура,
		|	ВТ_Номенклатура.Ссылка.Наименование КАК Наименование
		|ИЗ
		|	ВТ_Номенклатура КАК ВТ_Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныПродажиНоменклатуры.СрезПоследних КАК ЦеныПродажиНоменклатурыСрезПоследних
		|		ПО ВТ_Номенклатура.Ссылка = ЦеныПродажиНоменклатурыСрезПоследних.Номенклатура";
	
	Запрос.Параметры.Вставить("Ссылка", МассивНоменклатуры);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат Выборка;
	

КонецФункции // ()
