// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   Булево   
//
Функция ИННВерен(ИНН)Экспорт 
	
	//ИННВерен = Ложь;
	//
	//Если СтрДлина(ИНН) < 10 Тогда
	//	Сообщить("Длина ИНН юр.лица не может быть меньше 10 символов!");
	//ИначеЕсли СтрДлина(ИНН) = 10 Тогда
	//	 
	//	МассивИНН = Новый Массив;
	//	
	//	Для Счетчик = 0 По 10 Цикл
	//		МассивИНН.Добавить(Сред(ИНН,Счетчик,1));
	//	КонецЦикла;
	//	
	//	ЧислоДомножения = Новый Массив(9);
	//	ЧислоДомножения[0] = 2;
	//	ЧислоДомножения[1] = 4;
	//	ЧислоДомножения[2] = 10;
	//	ЧислоДомножения[3] = 3;
	//	ЧислоДомножения[4] = 5;
	//	ЧислоДомножения[5] = 9;
	//	ЧислоДомножения[6] = 4;
	//	ЧислоДомножения[7] = 6;
	//	ЧислоДомножения[8] = 8;    
	//	
	//	КонтрольнаяСумма = 0; 
	//	
	//	Для Счетчик = 0 По ЧислоДомножения.ВГраница() Цикл
	//		КонтрольнаяСумма = КонтрольнаяСумма + МассивИНН[Счетчик] * ЧислоДомножения[Счетчик];
	//	КонецЦикла;   
	//	
	//	КонтрольныйРазрядИНН = Число(МассивИНН[МассивИНН.ВГраница()]);
	//	
	//	КонтрольныйРазряд = ?(КонтрольнаяСумма%11 > 10, 0, КонтрольнаяСумма%11); 
	//	
	//	Если КонтрольныйРазряд = КонтрольныйРазрядИНН Тогда
	//		ИННВерен = Истина;
	//	КонецЕсли; 
	//	
	//ИначеЕсли СтрДлина(ИНН) = 12 Тогда   
	//	
	//	ИННВерен = Истина   
	//	
	//КонецЕсли;
	//
	//Возврат ИННВерен;
	Возврат Истина;

КонецФункции // ()
