
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если Не Согласовано Тогда
		Отказ = Истина;
		Сообщить("Согласуйте документ!");
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ЦеныПродажиНоменклатуры.Записывать = Истина;
	
	Для Каждого СтрокаЦены Из Цены Цикл
		
		ОтборПоНоменклатуре = РаботаСНоменклатуройСервер.НовыйОтборПоКонтрагентуИНоменклатуре(СтрокаЦены.Номенклатура);
		ДублиСтрокиЦены = Цены.НайтиСтроки(ОтборПоНоменклатуре);
		
		Если ДублиСтрокиЦены.Количество()>1 Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("В таблицу товаров введен дубль номенклатуры %1!",СтрокаЦены.Номенклатура.Наименование);
			Сообщение.Сообщить();
			
			Отказ = Истина;
			
			Возврат;
			
		КонецЕсли;
		
		ДвижениеЦены = Движения.ЦеныПродажиНоменклатуры.Добавить();
		ДвижениеЦены.Период = Дата;
		ДвижениеЦены.Номенклатура = СтрокаЦены.Номенклатура;
		ДвижениеЦены.Цена = СтрокаЦены.Цена;
		ДвижениеЦены.Ответственный = Ответственный;
		
	КонецЦикла;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Ответственный = ПараметрыСеанса.СотрудникТекущегоПользователя;
	
КонецПроцедуры
