
&НаКлиенте
Процедура ЗаполнитьГрафикЗаТекущийМесяц(Команда)
	ЗаполнитьГрафикЗаТекущийМесяцНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьГрафикЗаТекущийМесяцНаСервере()
	
	Курсор = НачалоМесяца(ТекущаяДата());
	ДатаОкончания = КонецМесяца(ТекущаяДата());
	
	Пока Курсор <= ДатаОкончания Цикл
		
		Запись = РегистрыСведений.Календарь.СоздатьМенеджерЗаписи();
		Запись.Дата = Курсор;
		Запись.РабочийДень = ?(ДеньНедели(Курсор)<=5, 1, 0);
		
		Запись.Записать();
		
		Курсор = Курсор + 86400;
		
	КонецЦикла;
	
КонецПроцедуры
