
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если Объект.Согласовано Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	Если РольДоступна("ПолныеПрава") Тогда
		ЭтаФорма.ТолькоПросмотр = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЦеныНоменклатураПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Цены.ТекущиеДанные;
	ПриИзмененииНоменклатуры(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииНоменклатуры(ИзмененнаяСтрока)

	Если ЗначениеЗаполнено(ИзмененнаяСтрока.Номенклатура) Тогда
		ИзмененнаяСтрока.Цена = ЦеныВызовСервера.ЦенаНаДату(ИзмененнаяСтрока.Номенклатура, ТекущаяДата());
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
	ПараметрыОткрытияФормы.Вставить("РежимВыбора", Истина);
	
	ДополнительныеПараметры = Новый Структура;
	ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаВыбора", ПараметрыОткрытияФормы, Элементы.Цены);
	
КонецПроцедуры

&НаКлиенте
Процедура ЦеныОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Цены = Объект.Цены;
	
	Цены.Добавить().Номенклатура = ВыбранноеЗначение;
	
	ПоследняяСтрока = Цены.Получить(Цены.Количество()-1);
	
	ПриИзмененииНоменклатуры(ПоследняяСтрока);
	
КонецПроцедуры
