
&НаКлиенте
Процедура АдресФотоНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ВыбратьФайлФото();
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ВыбратьФайлФото()
	
	Перем ОписаниеФайла, ПараметрыДиалога;
	
	ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов;
	ПараметрыДиалога.Заголовок = "Выберите фотографию сотрудника";
	ПараметрыДиалога.МножественныйВыбор = Ложь;
	ПараметрыДиалога.Фильтр = "Картинки|*.png; *.jpg";
	
	ОписаниеФайла = Ждать ПоместитьФайлНаСерверАсинх(,,,ПараметрыДиалога,УникальныйИдентификатор);
	
	Если ОписаниеФайла = Неопределено ИЛИ ОписаниеФайла.ПомещениеФайлаОтменено Тогда
		Возврат;
	КонецЕсли;
	
	АдресФото = ОписаниеФайла.Адрес;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Не ЗначениеЗаполнено(АдресФото) Тогда
		ТекущийОбъект.Фотография = Неопределено;
	Иначе
		ДвоичныеДанныеФото = ПолучитьИзВременногоХранилища(АдресФото);
		ДанныеВХранилище = Новый ХранилищеЗначения(ДвоичныеДанныеФото);
		ТекущийОбъект.Фотография = ДанныеВХранилище;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДвоичныеДанныеФото = ТекущийОбъект.Фотография.Получить();
	АдресФото = ПоместитьВоВременноеХранилище(ДвоичныеДанныеФото,УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьФото(Команда)
	
	Если Не ЗначениеЗаполнено(АдресФото) Тогда
		Возврат;
	КонецЕсли;
	
	АдресОбработаннойКартинки = ПодготовитьФото(АдресФото, УникальныйИдентификатор);
	
	Если Не ЗначениеЗаполнено(АдресОбработаннойКартинки) Тогда 
		Возврат;
	КонецЕсли;
	
	ПараметрыПолученияФайла = Новый ПараметрыДиалогаПолученияФайлов;

	ИмяФайла = СтрШаблон("%1%2",Объект.Наименование,".jpg");
	
	ПолучитьФайлССервераАсинх(АдресОбработаннойКартинки,ИмяФайла,ПараметрыПолученияФайла);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПодготовитьФото(АдресФото, УИД)
	
	ДвоичныеДанныеФото = ПолучитьИзВременногоХранилища(АдресФото);
	
	Если ДвоичныеДанныеФото = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Картинка = Новый Картинка(ДвоичныеДанныеФото);
	
	Если Картинка.Ширина() = 100 Тогда
		Возврат АдресФото;
	КонецЕсли;
	
	ОбрабатываемаяКартинка = Новый ОбрабатываемаяКартинка(Картинка);
	ОбрабатываемаяКартинка.УстановитьРазмер(100,Неопределено);
	
	Картинка = ОбрабатываемаяКартинка.ПолучитьКартинку();
	
	ДвоичныеДанныеКартинки = Картинка.ПолучитьДвоичныеДанные();
	
	АдресОбработаннойКартинки = ПоместитьВоВременноеХранилище(ДвоичныеДанныеКартинки,УИД);
	
	Возврат АдресОбработаннойКартинки;
	
КонецФункции

&НаКлиенте
Процедура УдалитьФото(Команда)
	
	АдресФото = "";
	
КонецПроцедуры
