Процедура ПринятьКИсполнению(Задача) Экспорт

	Запрос = Новый Запрос("ВЫБРАТЬ
		|	Задача.Выполнена КАК Выполнена,
		|	Задача.Исполнитель КАК Исполнитель,
		|	Задача.Роль КАК Роль
		|ИЗ
		|	Задача.Задача КАК Задача
		|ГДЕ
		|	Задача.Ссылка = &Ссылка");
	
	Запрос.УстановитьПараметр("Ссылка", Задача);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Не Выборка.Следующий() Тогда
		Сообщить("Не выбрана задача, принятие невозможно");
		Возврат;
	КонецЕсли;
	
	Исполнитель = Выборка.Исполнитель;
	
	Если Исполнитель = ПараметрыСеанса.СотрудникТекущегоПользователя Тогда
		
		Сообщить("Задача уже принята к исполнению вами");
		Возврат;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Исполнитель) Тогда
		
		Сообщить("Задача уже принята к исполнению другим сотрудником");
		Возврат;
		
	КонецЕсли;
	
	Задача = Задача.ПолучитьОбъект();
	Задача.Исполнитель = ПараметрыСеанса.СотрудникТекущегоПользователя;
	Задача.Записать();

КонецПроцедуры
