
//@skip-check data-exchange-load
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СуммаДокумента = Товары.Итог("Сумма"); 
	Ответственный = ПараметрыСеанса.СотрудникТекущегоПользователя;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ТоварыДляДвижений = ТоварыДляДвижений();
	
	ТипУслуга = Перечисления.ТипыНоменклатуры.Услуга;
	
	Движения.Товары.Записывать = Истина;
	Движения.ВзаиморасчетыСКонтрагентами.Записывать = Истина;
	Движения.Расходы.Записывать = Истина;
	Движения.Управленческий.Записывать = Истина;
	
	ДвижениеВзаиморасчетыСКонтрагентами = Движения.ВзаиморасчетыСКонтрагентами.ДобавитьРасход();
	ДвижениеВзаиморасчетыСКонтрагентами.Контрагент = Контрагент;
	ДвижениеВзаиморасчетыСКонтрагентами.Сумма = СуммаДокумента;
	ДвижениеВзаиморасчетыСКонтрагентами.Период = Дата;
	
	Для каждого СтрокаТоварыДляДвижений Из ТоварыДляДвижений Цикл
	
		Если СтрокаТоварыДляДвижений.ТипНоменклатуры = ТипУслуга Тогда
			ДвижениеРасход = Движения.Расходы.Добавить();
			ДвижениеРасход.Номенклатура = СтрокаТоварыДляДвижений.Номенклатура;
			ДвижениеРасход.Сумма = СтрокаТоварыДляДвижений.Сумма;
			ДвижениеРасход.Период = Дата;
			Продолжить;
		КонецЕсли;
		
		ДвижениеТовары = Движения.Товары.ДобавитьПриход();
		ДвижениеТовары.Период = Дата;
		ДвижениеТовары.Количество = СтрокаТоварыДляДвижений.Количество;
		ДвижениеТовары.Номенклатура = СтрокаТоварыДляДвижений.Номенклатура;
		ДвижениеТовары.Сумма = СтрокаТоварыДляДвижений.Сумма;
		
		ДвижениеУправленческийУчет = Движения.Управленческий.Добавить();
		ДвижениеУправленческийУчет.СчетДт = ПланыСчетов.УправленческийПланСчетов.Товары;
		ДвижениеУправленческийУчет.СчетКт = ПланыСчетов.УправленческийПланСчетов.Поставщики;
		ДвижениеУправленческийУчет.Период = Дата;
		ДвижениеУправленческийУчет.Сумма = СуммаДокумента;
		ДвижениеУправленческийУчет.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Номенклатура] = СтрокаТоварыДляДвижений.Номенклатура;
		ДвижениеУправленческийУчет.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Контрагенты] = Контрагент;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ТоварыДляДвижений()

	Запрос = Новый Запрос("ВЫБРАТЬ
			|	ПоступлениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
			|	ПоступлениеТоваровУслугТовары.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
			|	СУММА(ПоступлениеТоваровУслугТовары.Сумма) КАК Сумма,
			|	СУММА(ПоступлениеТоваровУслугТовары.Количество) КАК Количество
			|ИЗ
			|	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
			|ГДЕ
			|	ПоступлениеТоваровУслугТовары.Ссылка = &Ссылка
			|
			|СГРУППИРОВАТЬ ПО
			|	ПоступлениеТоваровУслугТовары.Номенклатура.ТипНоменклатуры,
			|	ПоступлениеТоваровУслугТовары.Номенклатура");
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат РезультатЗапроса;
	
КонецФункции // ()
