
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СуммаДокумента = Товары.Итог("Сумма");
	Ответственный = ПараметрыСеанса.СотрудникТекущегоПользователя;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.Товары.Записывать = Истина;
	Движения.Товары.Записать();
	
	Движения.Продажи.Записывать = Истина;
	Движения.Продажи.Записать();
	
	Движения.ВзаиморасчетыСКонтрагентами.Записывать = Истина;
	Движения.ВзаиморасчетыСКонтрагентами.Записать();
	
	Движения.Расходы.Записывать = Истина;
	Движения.Расходы.Записать();
	
	Движения.Доходы.Записывать = Истина;
	Движения.Доходы.Записать();
	
	Движения.Управленческий.Записывать = Истина;
	Движения.Управленческий.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
			|	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
			|	СУММА(РеализацияТоваровУслугТовары.Количество) КАК Количество,
			|	СУММА(РеализацияТоваровУслугТовары.Цена) КАК Цена,
			|	СУММА(РеализацияТоваровУслугТовары.Сумма) КАК Сумма
			|ПОМЕСТИТЬ ВТ_ДанныеДокумента
			|ИЗ
			|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
			|ГДЕ
			|	РеализацияТоваровУслугТовары.Ссылка.Ссылка = &Ссылка
			|
			|СГРУППИРОВАТЬ ПО
			|	РеализацияТоваровУслугТовары.Номенклатура
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	Номенклатура
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СУММА(ЕСТЬNULL(ТоварыОстатки.КоличествоОстаток, 0)) КАК КоличествоОстаток,
			|	СУММА(ЕСТЬNULL(ТоварыОстатки.СуммаОстаток, 0)) КАК СуммаОстаток,
			|	ВТ_ДанныеДокумента.Номенклатура КАК Номенклатура,
			|	ВТ_ДанныеДокумента.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
			|	СУММА(ЕСТЬNULL(ВТ_ДанныеДокумента.Количество, 0)) КАК Количество,
			|	СУММА(ЕСТЬNULL(ВТ_ДанныеДокумента.Сумма, 0)) КАК Сумма
			|ИЗ
			|	ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Товары.Остатки(
			|				&Период,
			|				Номенклатура В
			|					(ВЫБРАТЬ
			|						ВТ_ДанныеДокумента.Номенклатура КАК Номенклатура
			|					ИЗ
			|						ВТ_ДанныеДокумента)) КАК ТоварыОстатки
			|		ПО ВТ_ДанныеДокумента.Номенклатура = ТоварыОстатки.Номенклатура
			|
			|СГРУППИРОВАТЬ ПО
			|	ВТ_ДанныеДокумента.Номенклатура,
			|	ВТ_ДанныеДокумента.Номенклатура.ТипНоменклатуры";
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Запрос.УстановитьПараметр("Период", Новый Граница(МоментВремени(),ВидГраницы.Исключая));

	Выборка = Запрос.Выполнить().Выбрать();

	ДвижениеВзаиморасчеты = Движения.ВзаиморасчетыСКонтрагентами.ДобавитьПриход();
	ДвижениеВзаиморасчеты.Период = Дата;
	ДвижениеВзаиморасчеты.Сумма = СуммаДокумента;
	ДвижениеВзаиморасчеты.Контрагент = Контрагент;
	
	ДвижениеУправленческийУчет = Движения.Управленческий.Добавить();
	ДвижениеУправленческийУчет.СчетДт = ПланыСчетов.УправленческийПланСчетов.Покупатели;
	ДвижениеУправленческийУчет.СчетКт = ПланыСчетов.УправленческийПланСчетов.Выручка;
	ДвижениеУправленческийУчет.Период = Дата;
	ДвижениеУправленческийУчет.Сумма = СуммаДокумента;
	ДвижениеУправленческийУчет.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Контрагенты] = Контрагент;
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Товар Тогда
			ДвижениеПродажи = Движения.Продажи.Добавить();
			ДвижениеПродажи.Период = Дата;
			ДвижениеПродажи.Сумма = Выборка.Сумма;
			ДвижениеПродажи.Номенклатура = Выборка.Номенклатура;
			ДвижениеПродажи.Сотрудник = Ответственный;
			
			Если Выборка.Количество > Выборка.КоличествоОстаток Тогда
				Отказ = Истина;  
				
				ТекстСообщения = СтрШаблон(НСтр("ru = 'По товару %1 не хватает товара'"),Выборка.Номенклатура);
				СообщитьПользователю(ТекстСообщения);
				Продолжить;
			КонецЕсли;
			
			Если Выборка.Количество = Выборка.КоличествоОстаток Тогда
				СуммаКСписанию = Выборка.СуммаОстаток;
			Иначе
				СуммаКСписанию = Выборка.СуммаОстаток * Выборка.Количество / Выборка.КоличествоОстаток;
			КонецЕсли;
			
			ДвижениеТовары = Движения.Товары.ДобавитьРасход();
			ДвижениеТовары.Период = Дата;
			ДвижениеТовары.Количество = Выборка.Количество;
			ДвижениеТовары.Сумма = СуммаКСписанию;
			ДвижениеТовары.Номенклатура = Выборка.Номенклатура;
			
			ДвижениеРасход = Движения.Расходы.Добавить();
			ДвижениеРасход.Период = Дата;
			ДвижениеРасход.Номенклатура = Выборка.Номенклатура;
			ДвижениеРасход.Сумма = СуммаКСписанию;
			
			ДвижениеУправленческийУчет = Движения.Управленческий.Добавить();
			ДвижениеУправленческийУчет.СчетДт = ПланыСчетов.УправленческийПланСчетов.Расходы;
			ДвижениеУправленческийУчет.СчетКт = ПланыСчетов.УправленческийПланСчетов.Товары;
			ДвижениеУправленческийУчет.Период = Дата;
			ДвижениеУправленческийУчет.Сумма = СуммаКСписанию;
			ДвижениеУправленческийУчет.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Номенклатура] = Выборка.Номенклатура;
			
		КонецЕсли;
		
		ДвижениеПриход = Движения.Доходы.Добавить();
		ДвижениеПриход.Период = Дата;
		ДвижениеПриход.Номенклатура = Выборка.Номенклатура;
		ДвижениеПриход.Количество = Выборка.Количество;
		ДвижениеПриход.Сумма = Выборка.Сумма;
		
	КонецЦикла;
	
КонецПроцедуры

Функция НовоеСообщениеПользователю()
	
	Результат = Новый СообщениеПользователю;
	
	Возврат Результат;
	
КонецФункции

Процедура СообщитьПользователю(ТекстСообщения)
	
	Сообщение = НовоеСообщениеПользователю();
	Сообщение.Текст = ТекстСообщения;
	Сообщение.Сообщить();
	
КонецПроцедуры 

Функция НовыйФильтрПоНоменклатуре()
	
	Результат = Новый Структура;
	Результат.Вставить("Номенклатура", Справочники.Номенклатура.ПустаяСсылка());
	
	Возврат Результат;
	
КонецФункции

Функция ЗаполнитьФильтрПоНоменклатуре(Номенклатура)
	
	Результат = НовыйФильтрПоНоменклатуре();
	Результат.Вставить("Номенклатура",Номенклатура);
	
	Возврат Результат;
	
КонецФункции 
