&НаКлиенте
Процедура ПрисвоитьУИДПользователя(Команда)
	ПрисвоитьУИДПользователяНаСервере();   
КонецПроцедуры

&НаСервере
Процедура ПрисвоитьУИДПользователяНаСервере() 
	
	
	УИДПользователя = ПользователиИнформационнойБазы.НайтиПоИмени(Объект.Сотрудник.Наименование).УникальныйИдентификатор;
	СотрудникОбъект = Объект.Сотрудник.ПолучитьОбъект();
	СотрудникОбъект.ИдентификаторПользователяИнформационнойБазы = УИДПользователя;
	
	Попытка
	
		СотрудникОбъект.Записать();
		Сообщить(СтрШаблон("УИД сотруднику %1 успешно присвоен!", СотрудникОбъект.Наименование));
		
		СтруктураСобытий = НоваяСтруктураСобытий();
		СтруктураСобытий.ИмяСобытия = "Заполнен УИД по сотруднику";
		СтруктураСобытий.ПредставлениеУровня = "Информация";
		СтруктураСобытий.Комментарий = СтрШаблон("Присвоен УИД сотруднику %1", СотрудникОбъект.Наименование);
		СтруктураСобытий.ДатаСобытия = ТекущаяДата();
		
		СобытияДляЖурналаРегистрации = НовыеСобытияДляЖурналаРегистрации();
		СобытияДляЖурналаРегистрации.Добавить(СтруктураСобытий);
		ЗаписьЖурналаРегистрации(СобытияДляЖурналаРегистрации);
		
	Исключение 
		
		Сообщить(СтрШаблон("УИД сотруднику %1 не присвоен: %2", СотрудникОбъект.Наименование,ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())));
		
		СтруктураСобытий = НоваяСтруктураСобытий();
		СтруктураСобытий.ИмяСобытия = "Не заполнен УИД по сотруднику";
		СтруктураСобытий.ПредставлениеУровня = "Ошибка";
		СтруктураСобытий.Комментарий = СтрШаблон("УИД не присвоен сотруднику %1", СотрудникОбъект.Наименование);
		СтруктураСобытий.ДатаСобытия = ТекущаяДата();
		
		СобытияДляЖурналаРегистрации = НовыеСобытияДляЖурналаРегистрации();
		СобытияДляЖурналаРегистрации.Добавить(СтруктураСобытий);
		ЗаписьЖурналаРегистрации(СобытияДляЖурналаРегистрации);
		
	КонецПопытки;
	
	
КонецПроцедуры

&НаСервере
Функция НоваяСтруктураСобытий()

	Результат = Новый Структура();
	Результат.Вставить("ИмяСобытия", Неопределено);
	Результат.Вставить("ПредставлениеУровня", Неопределено);
	Результат.Вставить("Комментарий", Неопределено);
	Результат.Вставить("ДатаСобытия", Неопределено);
	
	Возврат Результат;
	
КонецФункции   

&НаСервере
Функция НовыеСобытияДляЖурналаРегистрации()
	
	Результат = Новый СписокЗначений();
	
	Возврат Результат;
	
КонецФункции

 