Функция ПолучитьВремяСНачалаДня()Экспорт

	РабочийДеньНачинается = НачалоДня(ТекущаяДата()) + 9*60*60;
	ПрошлоВремениСНачалаРабочегоДня = Цел((ТекущаяДата()-РабочийДеньНачинается)/60);
	
	Возврат ПрошлоВремениСНачалаРабочегоДня; 
	
КонецФункции 

Функция ОпределитьВыходнойИлиБуднийДеньСоВременем(Дата)Экспорт
	
	ВидДняНеделиИВремя = "Выходной, не думай о времени!";
	
	Если Не ДеньНедели(Дата) = 6 И Не ДеньНедели(Дата) = 7 Тогда
		
		РабочееВремя = Цел((Дата - НачалоДня(Дата))/(60*60));
		
		Если РабочееВремя < 9 Тогда
			ВидДняНеделиИВремя = "Рабочее время ещё не началось.";
		ИначеЕсли РабочееВремя >= 9 И РабочееВремя < 18 Тогда
			ВидДняНеделиИВремя = "Рабочее время идет";
		ИначеЕсли РабочееВремя > 18 Тогда
			ВидДняНеделиИВремя = "Рабочее время завершилось";
		Иначе
			ВидДняНеделиИВремя = "Сейчас не рабочее время";
		КонецЕсли;
	КонецЕсли;
	
	Возврат ВидДняНеделиИВремя;
	
КонецФункции  

Функция ПолучитьМассивПраздников()Экспорт
	
	МассивПраздничныхДат = Новый Массив;
	
	ТекущийГод = Год(ТекущаяДата());
	
	ДеньНаследияАмериканскихИндейцев = Новый Структура;
	ДеньНаследияАмериканскихИндейцев.Вставить("Наименование", "День наследия американских индейцев");
	ДеньНаследияАмериканскихИндейцев.Вставить("Дата", Дата(ТекущийГод,9,10)); 
	МассивПраздничныхДат.Добавить(ДеньНаследияАмериканскихИндейцев);
	
	НовыйГод = Новый Структура;
	НовыйГод.Вставить("Наименование", "Новый год");
	НовыйГод.Вставить("Дата", Дата(ТекущийГод,1,1));
	МассивПраздничныхДат.Добавить(НовыйГод);
	
	ВсероссийскийДеньТрезвости = Новый Структура;
	ВсероссийскийДеньТрезвости.Вставить("Наименование", "Всероссийский день трезвости");
	ВсероссийскийДеньТрезвости.Вставить("Дата", Дата(ТекущийГод,9,11));
	МассивПраздничныхДат.Добавить(ВсероссийскийДеньТрезвости);
	
	Возврат МассивПраздничныхДат
	
КонецФункции  

