// Функция СотрудникТекущегоПользователя - возвращает значение одноименного параметра сеанса
//
// Возвращаемое значение:
//   СправочникСсылка.Сотрудники
//
Функция СотрудникТекущегоПользователя()Экспорт

	Возврат ПараметрыСеанса.СотрудникТекущегоПользователя;

КонецФункции // СотрудникТекущегоПользователя()

// Функция ДеньРожденияТекущегоПользователя - возвращает день рождения текущего пользователя
//
// Возвращаемое значение:
//  Дата
//
Функция ДеньРожденияТекущегоПользователя()Экспорт

	Возврат ПараметрыСеанса.СотрудникТекущегоПользователя.ДатаРождения;

КонецФункции // ДеньРожденияТекущегоПользователя()

// Функция ПолноеИмяПользователя - возвращает полное имя пользователя
//
// Возвращаемое значение:
//  Строка   
//
Функция СотрудникПоИмениПользователя()Экспорт
	
	ПолноеИмяСотрудника = ПользователиИнформационнойБазы.ТекущийПользователь().ПолноеИмя; 
	СоответствующийСотрудник = Справочники.Сотрудники.НайтиПоНаименованию(ПолноеИмяСотрудника);
	
	Возврат  СоответствующийСотрудник; 

КонецФункции // ПолноеИмяСотрудника()

 