
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ПрайсЛист(ТабличныйДокумент, ПараметрКоманды);

	ТабличныйДокумент.ОтображатьСетку = Ложь;
	ТабличныйДокумент.Защита = Ложь;
	ТабличныйДокумент.ТолькоПросмотр = Ложь;
	ТабличныйДокумент.ОтображатьЗаголовки = Ложь;
	ТабличныйДокумент.Показать();
	
КонецПроцедуры

&НаСервере
Процедура ПрайсЛист(ТабличныйДокумент, ПараметрКоманды)
	Справочники.Номенклатура.ПрайсЛист(ТабличныйДокумент, ПараметрКоманды);
КонецПроцедуры
