
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если Не Согласовано Тогда
		Отказ = Истина;
		Сообщить("Согласуйте документ!");
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.Скидки.Записывать = Истина;
	
	Для Каждого СтрокаСкидки Из Скидки Цикл
		
		ДвижениеЦены = Движения.Скидки.Добавить();
		ДвижениеЦены.Период = Дата;
		ДвижениеЦены.НоменклатураНоменклатурнаяГруппа = СтрокаСкидки.НоменклатураНоменклатурнаяГруппа;
		ДвижениеЦены.Скидка = СтрокаСкидки.Скидка;
		ДвижениеЦены.Ответственный = Ответственный;
		
	КонецЦикла;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Ответственный = ПараметрыСеанса.СотрудникТекущегоПользователя;
	
КонецПроцедуры
