Функция ОбработкаСтроки(СтрокаДляОбработки)Экспорт
	
	УбратьЛишниеСимволы(СтрокаДляОбработки);
	Возврат ВРег(СокрЛП(СтрокаДляОбработки));
	
КонецФункции 

Процедура УбратьЛишниеСимволы(СтрокаДляОбработки)

	МассивСимволов = Новый Массив;
	
	МассивСимволов.Добавить(" ");  
	МассивСимволов.Добавить(Символы.Таб);
	МассивСимволов.Добавить(Символы.НПП); 
	МассивСимволов.Добавить(Символы.ВТаб);
	МассивСимволов.Добавить(Символы.ПС);
	
	Для Каждого ЭлементСимвол Из МассивСимволов Цикл   
		СтрокаДляОбработки = СтрЗаменить(СтрокаДляОбработки,ЭлементСимвол,"");
	КонецЦикла;
	
КонецПроцедуры

Функция ПривестиСтрокуКНижнемуРегистру(СтрокаДляОбработки)Экспорт
	Возврат НРег(СокрЛП(СтрокаДляОбработки));
КонецФункции 

