Функция СуммаНДСПоСтавке(Знач Сумма, Знач СтавкаНДС) Экспорт
	
	СуммаНДС = 0;
	
	Если СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС10") Тогда
		СтавкаНДСВПроцентах = 0.1;
	ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20") Тогда
		СтавкаНДСВПроцентах = 0.2;
	Иначе
		СтавкаНДСВПроцентах = 0;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтавкаНДСВПроцентах) Тогда
		СуммаНДС = Сумма * СтавкаНДСВПроцентах / (1 + СтавкаНДСВПроцентах);
	КонецЕсли;
		
	Возврат СуммаНДС;
	
КонецФункции
